Description: Downloads Avast Antivirus for Windows.
Identifier: github.com.swifteaminc.recipes.download.Avast-Win
MinimumVersion: 1.3.1

Input:
  NAME: Avast
  DOWNLOAD_URL: https://www.avast.com/download-thank-you.php?product=FAV-ONLINE-W10-160535-TC&locale=en-ww&direct=1

Process:
- Processor: URLDownloader
  Arguments:
    filename: avast_free_antivirus_setup_online.exe
    url: '%DOWNLOAD_URL%'

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False