Description: Downloads Slack EXE for Windows.
Identifier: github.com.swifteaminc.recipes.download.Slack-EXE
MinimumVersion: 1.3.1

Input:
  NAME: Notion
  DOWNLOAD_URL: https://slack.com/downloads/instructions/windows?ddl=1&build=win64

Process:
- Processor: URLDownloader
  Arguments:
    CHECK_FILESIZE_ONLY: false
    filename: 'SlackSetup.exe'
    #https://downloads.slack-edge.com/desktop-releases/windows/x64/4.39.88/SlackSetup.exe
    url: https://downloads.slack-edge.com/desktop-releases/windows/x64/%ver3digit%/SlackSetup.exe

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False