Description: Downloads Slack EXE for Windows.
Identifier: github.com.swifteaminc.recipes.download.Slack-EXE
MinimumVersion: 1.3.1

Input:
  NAME: Slack
  SEARCH_URL_EXE: (?P<msi_dl_link>https://downloads\.slack-edge\.com/releases/windows/(?P<ver3digit>[0-9]+\.[0-9]+\.[0-9]+)/prod/x64/SlackSetup.exe)
  DOWNLOAD_FILE: Slack

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: '%SEARCH_URL_EXE%'
    url: https://slack.com/intl/en-ch/release-notes/windows/rss

- Processor: URLDownloader
  Arguments:
    CHECK_FILESIZE_ONLY: false
    filename: 'SlackSetup.exe'
    #https://downloads.slack-edge.com/desktop-releases/windows/x64/4.39.88/SlackSetup.exe
    url: https://downloads.slack-edge.com/desktop-releases/windows/x64/%ver3digit%/SlackSetup.exe

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False