Description: Downloads Slack EXE for Windows.
Identifier: github.com.swifteaminc.recipes.download.Slack-EXE
MinimumVersion: 1.3.1

Input:
  NAME: Notion
  DOWNLOAD_URL: https://slack.com/downloads/instructions/windows?ddl=1&build=win64

Process:
- Processor: URLDownloader
  Arguments:
    filename: SlackSetup.exe
    url: '%DOWNLOAD_URL%'

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False