Description: Download recipe for 7-Zip EXE x64.
# based upon: https://github.com/autopkg/NickETH-recipes/blob/master/Bitwarden/Bitwarden-Desktop-Win64.download.recipe.yaml
Identifier: github.com.swifteaminc.recipes.download.7-Zip-Win-EXE
MinimumVersion: 1.3.1

Input:
  NAME: 7zip
  PLATFORM: x64
  PF_STRING: _64

Process:
- Processor: GitHubReleasesInfoProvider
  Arguments:
    #7z2406.exe
    asset_regex: 7z([0-9]+\.)*[0-9]+\.exe
    github_repo: ip7z/7zip

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%-%PLATFORM%.exe'

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False