Description: Downloads Notion for Windows.
Identifier: github.com.swifteaminc.recipes.download.Notion-Win
MinimumVersion: 1.3.1

Input:
  NAME: Notion
  DOWNLOAD_URL: https://www.notion.so/desktop/windows/download

Process:
- Processor: URLDownloader
  Arguments:
    filename: NotionSetup.exe
    url: '%DOWNLOAD_URL%'

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False