Description: Downloads 1Password for Windows.
Identifier: github.com.swifteaminc.recipes.download.1Password-Win
MinimumVersion: 1.3.1

Input:
  NAME: 1Password
  DOWNLOAD_URL: https://downloads.1password.com/win/1PasswordSetup-latest.msi

Process:
- Processor: URLDownloader
  Arguments:
    filename: 1PasswordSetup-latest.msi
    url: '%DOWNLOAD_URL%'

- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False
